{"/about":{"title":"About","data":{"":"This is intended to be a resource for staking taxes.Feel free to submit feedback and questions to https://github.com/stakingtaxes"}},"/country/usa":{"title":"Taxation (United States)","data":{"eth-validator-remuneration#ETH Validator Remuneration":"Layer\tType\tPaid to\tConsensus\tAttestation\tWithdrawal address\tConsensus\tBlock Proposal\tWithdrawal address\tConsensus\tSync Committee\tWithdrawal address\tConsensus\tSlashing Reward\tWithdrawal address\tExecution\tMEV Rewards\tSuggested Fee Recipient\tExecution\tPriority Fees\tSuggested Fee Recipient","consensus-layer-rewards#Consensus Layer rewards":"Consensus Layer rewards are subject to tax at ordinary income rates at their fair market value when received.https://www.irs.gov/pub/irs-drop/rr-23-14.pdf*Withdrawals of Consensus Layer rewards were only enabled on 12 Apr 2023 despite the Beacon Chain being shipped in 2020.","tracking-tools#Tracking Tools":"https://beaconcha.in/rewardshttps://ethstaker.tax/These 2 tools track changes in daily balances. Alternatively, you can also track using deposits to the withdrawal address as they happen every 3-4 days.","execution-layer-rewards#Execution Layer rewards":"Execution Layer rewards are subject to tax at ordinary income rates at fair market value when received. Unlike Consensus Layer rewards which could only be withdrawn on 12 Apr 2023, Execution Layer rewards have always been available for spending immediately when received.","tracking-tools-1#Tracking Tools":"The only way to capture the track the accurate Execution Layer income number as a third party is if you know which exact address Execution Layer rewards are being sent to for that specific validator. You will need to obtain an accurate summary of all Execution Layer rewards and which addresses they have been sent to.","coinbases-tax-treatment-of-staking-rewards#Coinbase’s tax treatment of staking rewards":"Coinbase’s tax position is that staking rewards were not considered taxable prior to 12 Apr 2023 since stakers were unable to sell or realize earned rewards. On the date when fulfillment of unstaking requests began (slightly after 12 Apr 2023), Coinbase would sum up all prior rewards earned so far as income, using the market price of ETH as of the date.Source: https://help.coinbase.com/en/coinbase/taxes/general-information/eth-taxes","accounting-method-fifo-lifo-hifo-or-specific-id#Accounting method FIFO, LIFO, HIFO or specific ID":"As a rule, one should stick with the accounting method they have chosen.\nFor those that were early to staking, LIFO or HIFO would be the preferred method to minimize capital gains tax.\nThis piece by Shehan Chandrasekera covers the various accounting methods\nSpecific ID involves tracking each individual lot of an asset so you have the cost basis of each individual token.\nAccording to the crypto tax guidance issued by the IRS (A39), taxpayers can use specific identification to calculate the cost basis of each unit of crypto asset they are disposing of. Specific ID means that each time you dispose of a crypto asset, you are specifically identifying which specific unit you are selling. In order to use this method, you must keep detailed records of all the following information:\nthe date and time each unit was acquired\nyour basis and the fair market value of each unit at the time it was acquired\nthe date and time each unit was sold, exchanged, or otherwise disposed of\nthe fair market value of each unit when sold, exchanged, or disposed of, and\nthe amount of money or the value of property received for each unit. the fair market value of each unit when sold, exchanged, or disposed of, and the amount of money or the value of property received for each unit.","2022-taxes-relating-to-eth-staking#2022 taxes relating to ETH staking":"Report only Execution Layer income following The Merge on 15 September 2022. This should be reported as income when received.","2023-taxes-relating-to-eth-staking#2023 taxes relating to ETH staking":"Execution Layer income continues to be reported as income when received.\nReport all Consensus Layer rewards leading up to 12 April 2023 as one-time income. Subsequently, report Consensus Layer rewards daily or withdrawals every 3-4 days when received."}},"/country/germany":{"title":"Germany","data":{"":"Germany has friendly crypto taxation rules. Staking rewards are taxed as income, however the staked coins themselves are not taxed if held for more than a year.Source: https://koinly.io/guides/crypto-tax-germany/The BZSt says you'll pay Income Tax on staking rewards based on the fair market value of any coins in EUR on the day you received them.An important thing to note regarding staking taxes that the BZSt has now clarified is the holding period for staked tokens. Originally, investors thought that they'd pay Income Tax on any profits from disposing of staked tokens held for less than 10 years. However, this has now changed to the standard one-year holding period after updated guidance in 2022.This means you'll only pay Income Tax on profits when you dispose of staked tokens if you've held them for less than one year, otherwise, it's tax free. the initial 32 ETH would not apply since you held that initial investment for 2 years. Capital gains on the difference between the cost basis and sell price of earned ETH would only apply to ETH earned in the last 1 year."}},"/":{"title":"Introduction","data":{"understanding-staking-taxes#Understanding Staking Taxes":"There are various ways to stake. We start off with the basic concepts on how validators stake ETH, the different types of rewards and then dive into the other ways which investors use to gain exposure to staking.Staking taxes are an evolving area and most countries have not issued detailed guidance on how staking should be taxed.","understanding-how-a-validator-earns-eth#Understanding how a validator earns ETH":"Validators that participate in securing the Beacon Chain and execute duties get rewarded with new issuance of ETH. These activities happen at the Consensus Layer, i.e. “which block is next” and include the following: attestations, block proposals, sync committees, slashing reports.\nIn addition, validators also receive priority fees paid by users, and optionally Maximal Extractable Value activities MEV from block proposals. Priority fees and MEV are paid from ETH that already exist. These activities happen at the Execution Layer, “the Ethereum Virtual Machine” where user transactions take place."}},"/liquid-staking":{"title":"Liquid Staking","data":{"":"Popular choices: Lido Finance, Rocket Pool, Coinbase cbETHLiquid staking is a popular option for those who want to stake ETH but do not have the technical expertise to stake themselves or do not have sufficient capital to do so (since the minimum required to run a validator is 32 ETH).Liquid staking protocols like Lido Finance and Rocket Pool allow users to deposit ETH and then get a token such as stETH or rETH which represents the users’ ownership of the underlying staked assets as well as any rewards earned. Liquid staking tokens are transferable and can be unwrapped to exchange for the underlying staked assets. Liquid staking protocols take a cut of the rewards earned as their fee."}},"/liquid-staking/cbeth":{"title":"cbETH Coinbase Wrapped Staked ETH","data":{"":"Coinbase Wrapped Staked ETH (cbETH) is the liquid staking token offered by CoinbaseNote: Coinbase has different staking offerings. Investors can stake with Coinbase as a centralized exchange (in which case no cbETH is involved). Coinbase also has a liquid staking token cbETH that is an interesting hybrid. While it is offered by Coinbase, cbETH can be transferred into any wallet outside Coinbase and traded outside the exchange.cbETH is a non-rebasing token similar to wstETH and rETH.Source: https://www.coinbase.com/cbeth/whitepapercbETH will have rights to underlying staked ETH and accrued rewards and penalties. Changes in these underlying amounts would have effects on the conversion rate between cbETH and ETH. One can unwrap cbETH at any time. Rewards are earned but not directly through Coinbase","taxes#Taxes":"Source: https://help.coinbase.com/en/coinbase/taxes/general-information/eth-taxesWrapping and unwrapping cbETH generally are not considered taxable events, and selling cbETH is taxed as capital gain or loss.ETH staking rewards and cbETH earnings will be considered income as they’re paid out every 3-4 days."}},"/liquid-staking/reth":{"title":"rETH Rocket Pool","data":{"":"rETH is a liquid staking token issued by Rocket Pool. Similar to wstETH, the rETH token does not rebase. This means that if you hold rETH, the number of tokens in your wallet will remain constant but they appreciate in value over time.Similar to holding wstETH, it is unclear if staking rewards can be classified as capital gains only when sold, as opposed to being taxed at ordinary income rates at fair market value when received.","rocket-pool-node-operators#Rocket Pool node operators":"If you have more ETH you might want to become a Rocket Pool node operator to enjoy higher staking yields than a regular rETH holder.Source: https://docs.rocketpool.net/guides/staking/overview.htmlUnlike solo stakers which are required to put 32 ETH up for deposit to create a new validator, Rocket Pool nodes only need to deposit 8 or 16 ETH per validator (the \"bond\"). This will be coupled with 24 or 16 ETH (the \"borrowed\") from the staking pool (which \"normal\" stakers deposited in exchange for rETH) to create a new validator. This new validator is called a minipool.To the Beacon chain, a minipool looks exactly the same as a normal validator. It has the same responsibilities, same rules it must follow, same rewards, and so on. The only difference is in how the minipool was created on the ETH1 chain, and how withdrawals work when the node operator decides to voluntarily exit the minipool. All of the creation, withdrawing, and rewards delegation is handled by Rocket Pool's smart contracts on the Ethereum chain.A single Rocket Pool node can run many minipools.A minipool's upfront cost is either 16 ETH, plus at least 1.6 ETH worth of the RPL token, or 8 ETH plus at least 2.4 ETH worth of the RPL token. The supplemental RPL collateral acts as supplemental insurance against particularly egregious slashing incidents, and lets node operators participate in Rocket Pool's DAO.Node operators are responsible for:\nSetting up a computer (either physical or virtual)\nConfiguring it correctly\nInstalling Rocket Pool on it and setting up minipools to perform validation\nSecuring it, both from outside and inside threats\nMaintaining it for the life of their validators","benefits-of-running-a-rocket-pool-node#Benefits of running a Rocket Pool node:":"You earn your portion of each validator's ETH rewards, plus commission.\nFor an 8 ETH-bonded minipool, this comes to 35.5% of the validator's rewards (an extra 10.5% over solo staking).\nFor a 16 ETH-bonded minipool, this comes to 57.5% of the validator's rewards (an extra 7.5% over solo staking).\nYou earn interest on the RPL you stake as supplemental insurance.\nAt the end of a period (every 28 days), there's a snapshot of your RPL.\nYou can earn yield on RPL up to 150% of the value of your total bonded ETH.\nTo be eligible for these rewards, you must have at least 10% of the value of your total borrowed ETH to earn RPL rewards.\nYou will be able to participate in the DAO and get to vote on changes to Rocket Pool's protocol or settings.\nIn light of gaining access to these benefits, as a node operator you are responsible for your own performance. If your node performs poorly and you actually end up losing ETH by the time you decide to exit your minipool, all of the lost ETH is coming out of your share.\nIf you exit with a balance of 30 ETH, then your minipool lost 2 ETH from its\ninitial 32 ETH deposit. You will receive 14 or 6 ETH (depending on your bond\nsize), and 24 or 16 ETH will be returned to the staking pool.","rocketpool-node-remuneration-and-distribution#Rocketpool Node Remuneration and Distribution":"At regular intervals, Rocket Pool will flag a checkpoint on the network. Currently, checkpoints occur every 28 days.","1-consensus-layer-skimmed-rewards#1. Consensus Layer Skimmed Rewards":"Source: https://docs.rocketpool.net/guides/node/skimming.htmlThe ETH rewards you receive for running a validator for Ethereum are routinely sent to your minipools in a process referred to as \"skimming\". The frequency of skims depends on the number of active validators on the Beacon Chain. At the time of writing the number of validators is around 500,000 which results in a skim occurring approximately every 2-3 days.Skimmed rewards will accrue in each of your minipools until node operators \"distribute\" them. This process distributes the skimmed rewards betweenthe node operator, and rETH holders based on your commission rate and ratio of supplied and provided ETH.There is an Automatic Distribution and Manual Distribution option for distributing rewards.\nTo track how much you have in skimmed rewards, run rocketpool minipool distribute-balancewhich will tell you how much goes to you.\nThere is no official guidance on when rewards should be booked as income.This could be\neach time the Beacon Chain sends rewards to the minipool contract every 2-3 days or\nwhen each 28 day period ends and rewards are claimable\nYou can also use the same tools and calculate your share of rewards\nhttps://beaconcha.in/rewards\nhttps://ethstaker.tax/","2-execution-layer-rewards-and-rpl-rewards#2. Execution Layer Rewards and RPL rewards":"Source: https://docs.rocketpool.net/guides/node/rewards.htmlAs a Rocket Pool node operator, you are also entitled to regular rewards that will be provided in the form of the RPL token and (if you are opted into the Smoothing Pool) some ETH as well.To that end, the Smartnode will automatically set your node's fee recipient to either of these special contracts:\nYour node's own personal Fee Distributor (the default)\nThe Smoothing Pool (opt-in)\nIn brief, the Fee Distributor is a unique contract attached to your node that collects and fairly splits your priority fees between you and the rETH stakers. It's like your own personal vault for priority fees. Anyone (including you) can distribute its balance at any time to ensure that the rewards are always available to rETH stakers.The Smoothing Pool is a special opt-in contract that allows all participating node operators to aggregate and pool their priority fees together, and distributes them evenly among the participants during each Rocket Pool rewards interval (currently every 28 days) and the rETH pool stakers. This is a very compelling feature for node operators that don't want to worry about the luck factor involved in getting block proposals with high priority fees, and would rather have a nice, regular, consistent set of monthly earnings.\nLayer\tType\tPaid to\tConsensus\tAttestation\tWithdrawal address\tConsensus\tBlock Proposal\tWithdrawal address\tConsensus\tSync Committee\tWithdrawal address\tConsensus\tSlashing Reward\tWithdrawal address\tExecution\tMEV Rewards\tFee Distributor or Smoothing Pool\tExecution\tPriority Fees\tFee Distributor or Smoothing Pool\t\nTo track how much you have in Execution Layer Rewards and RPL, check your Fee Distributor or Smoothing Pool contract.\nTax on RPL rewards\nBook RPL as income upon receipt\nWhen you sell your RPL you incur capital gains or losses"}},"/liquid-staking/steth":{"title":"stETH Lido Finance","data":{"what-is-a-rebasing-token#What is a rebasing token?":"Rebase tokens are a type of token that adjusts their supply to maintain price stability. The circulating token supply adjusts (increases or decreases) automatically according to a token’s price fluctuations.","what-is-steth#What is stETH":"Source: https://blog.lido.fi/steth-the-mechanics-of-steth/ and https://docs.lido.fi/contracts/lido/#rebasingUsers who stake their ETH into the ETH staking contract via Lido will receive a liquid staking token stETH. If you stake 1 ETH with Lido, you receive 1 stETH in return.stETH is a rebasing token which rebases daily to reflect staking rewards earned everyday.Token balances are updated once a day at 12pm UTC when the oracle reports changes in staked ETH deposits and changes in ETH rewards from users who stake via Lido. As the rewards are embodied through a balance rebase, users who hold stETH will not see a transaction sent to their wallet. Instead, users will see their stETH balance automatically change without an accompanying transaction taking place.This is a much more efficient way for rewards to be distributed to the many holders of stETH without directly transferring rewards to each holder.Rebase tokens likely create daily taxable events though there has been no official guidance from the IRS yet.","how-to-track-steth-rewards#How to track stETH rewards":"Rewards can be tracked usinghttps://stake.lido.fi/rewards","is-converting-eth-to-steth-taxable#Is converting ETH to stETH taxable?":"Source: https://www.cointracker.io/blog/ethereum-2-tax-guideThere is no guidance yet but it is likely that the conversion from ETH to stETH is taxable and capital gains would also apply.Cryptocurrencies are treated as “property” per IRS Notice 2014-21. Consequently, a taxable event occurs each time you dispose of a coin. Disposition events include selling your coin for cash and also exchanging one coin with another one.To have a disposition event, both of the following criteria must be met (Reg §1.1001-1):\nThere must be an exchange and,\nProperty received must differ materially from the property given up (Material difference requirement)\nWhen you convert ETH to stETH, it is reasonable to think that you have transferred the tax ownership of your ETH to Lido triggering the Exchange requirement.stETH seems materially different from the ETH you had. It allows you to earn liquid staking rewards as opposed to regular ETH. Lastly, stETH price is not perfectly pegged to ETH which further supports the fact that they are materially different assets.","wsteth#wstETH":"wstETH is wrapped stETH. Some DeFi platforms such as Uniswap are not designed to work with rebasing tokens like stETH hence wstETH was introduced.Source: https://help.lido.fi/en/articles/5231836-what-is-wrapped-steth-wstethLido lets you \"wrap\" your stETH into wstETH to keep your balance of stETH fixed. Instead of updating daily, wstETH uses an underlying share system to reflect your staking rewards.\nExample:\nYou wrap 100 stETH to 99.87 wstETH.\nYou continue to get rewards on your wstETH.\nWhen you unwrap your wstETH, you receive 101 stETH.","what-happens-when-you-wrap-steth-into-wsteth#What happens when you wrap stETH into wstETH":"stETH rewards can be tracked here https://stake.lido.fi/rewardsHowever, once you wrap stETH into wstETH, you won’t be able to see the reward history.If you unwrap back to stETH, you can see the rewards going forward although rewards during the wrapped period will not be updated.\nAssuming you wrap on 1 July 2023 and then unwrap on 1 August 2023, the reward\nhistory will not include rewards between 1 July - 1 August 2023. You will need\nto record rewards between 1 July - 1 August 2023 separately.","steth-vs-wsteth-tax-treatment#stETH vs wstETH tax treatment":"If you hold stETH, it's likely you'll need to pay income taxes based on the fair market value of your rewards received which are reflected in your changing token balance everyday.However, in the case of wstETH, since it uses an underlying share system to reflect your staking rewards instead of rebasing, you don’t have rewards daily. Instead the value of the token increases.This brings about an interesting possibility - could you then possibly turn income taxes into capital gains taxes by holding wstETH instead of stETH?This raises many concerns, as explained in these pieces by Jason SchwartzThe Latest DeFi Alpha Is Tax-Optimized StakingSquaring the Circle: Smart Contracts and DAOs as Tax EntitiesAnalysis: Reading the Tea Leaves - What Enforcement Actions Mean for the U.S. Taxation of Crypto"}},"/solo-staking/consensus-layer":{"title":"Consensus Layer Rewards","data":{"":"Source: https://ethstaker.gitbook.io/ethstaker-knowledge-base/rewards/chain-rewards\nType\tLayer\tFrequency\tAmount\tAttestation\tConsensus\tOnce per Epoch (every 6.4 minutes on average)\t0.000014 ETH*\tBlock Proposal\tConsensus\tEvery 2 months on average\t0.02403 ETH*\tSync Committee\tConsensus\tEvery 2 years on average**\t0.11008 ETH*\tSlashing Reward\tConsensus\tVery rarely included in Block Proposals\tUp to 0.0625 ETH\t\n*Varies based on the total number of validators in the network. Estimate shown approximated for 435,000 active validators.**These are subject to randomness; there can be \"dry spells\" multiple times longer than the average without being given oneValidators are penalized for small amounts of ETH if they are offline and fail to perform their assigned duties. This is called leaking. They will be penalized at a rate slightly lower than the rewards for the same period of time.If a validator violates one of the core rules of the Beacon chain and appears to be attacking the network, it may get slashed. Slashing is a forceful exit of the validator without the validator’s permission, accompanied by a relatively large fine that removes some of the validator's ETH balance.Block proposers will receive a slashing reward if they include evidence of slashable offenses in their block.Note: Slashing rewards are not newly-issued ETH and is a very rare occurrence.","how-rewards-on-the-consensus-layer-can-be-tracked#How rewards on the Consensus Layer can be tracked":"Consensus Layer rewards come from new issuance of ETH.Rewards are accrued on each validator’s account. These can be tracked by tracking changes in validator balance every 24 hours. This can be easily verified even as an independent third party.Prior to the Shapella upgrade, validators could see their balance increase but withdrawals were not available until the upgrade happened.Currently, while rewards are constantly being accrued on each validator’s account, withdrawals are only available every 3-4 days. If the validator has set a withdrawal address, rewards can be tracked through deposits to the withdrawal address every 3-4 days.","tools-to-track-consensus-layer-rewards#Tools to track Consensus Layer rewards":"https://beaconcha.in/rewardshttps://ethstaker.tax/These 2 tools track changes in daily balances. Alternatively, you can also track using deposits to the withdrawal address as they happen every 3-4 days."}},"/solo-staking/execution-layer":{"title":"Execution Layer Rewards","data":{"":"Source: https://ethstaker.gitbook.io/ethstaker-knowledge-base/rewards/chain-rewards\nType\tLayer\tFrequency\tAmount\tPriority Fees\tExecution\tIncluded in every Block Proposal containing transactions\tTypically 0.01 to 0.1 ETH; very rarely 1+ ETH\tMEV Rewards\tExecution\tAlso included in Block Proposals when using MEV-boost\tTypically 0.01 to 0.1 ETH; very rarely 1+ ETH","how-rewards-on-the-execution-layer-can-be-tracked#How rewards on the Execution Layer can be tracked":"While Consensus Layer rewards were only withdrawable after the Shapella upgrade, Priority Fees and MEV Rewards are sent to an Execution Layer address and have been available for spending immediately.Tracking MEV fees is tricky as a third party. In a MEV block, a block builder replaces the fee_recipient from the validator’s suggested_fee_recipient to the builder’s address. Then, in the last transaction of the block, the builder does a plain ETH transfer to the original suggested_fee_recipient. The original suggested_fee_recipient data is not on-chain.As such, the only way to capture the track the accurate Execution Layer income number as a third party is if you know which exact address Execution Layer rewards are being sent to for that specific validator."}},"/solo-staking/key-events":{"title":"Key Events in Ethereum Staking","data":{"":"There have been a few key events in Ethereum’s staking history that affect the calculation of taxes.","1-ethereum-merge#1. Ethereum Merge":"Ethereum’s consensus mechanism used to be Proof-of-Work and miners instead of validators secured the network. When Ethereum was still using the Proof-of-Work system, the Consensus Layer was baked into the Execution Layer. The Beacon Chain was shipped on 1 December 2020 and co-existed while Ethereum was still using Proof-of-Work as a consensus mechanism.The Ethereum Merge took place on 15 September 2022 and consensus moved from Proof-of-Work to Proof-of-Stake. Post-merge, the Consensus Layer was moved to an external client.;","2-shapella-upgrade-and-withdrawals#2. Shapella Upgrade and withdrawals":"The Shapella Upgrade took place on 12 Apr 2023Before the Shapella Upgrade, validators who had been staking for >2 years since the Beacon Chain started could not withdraw their Consensus Layer rewards. Once withdrawals were enabled, this released >2 years of earnings to validators who started staking at Beacon Chain genesis on 1 December 2020.Note: Execution Layer rewards are not affected since they have always been available for spending immediately.","other-ways-to-get-staking-exposure#Other ways to get staking exposure":"We’ve covered what staking taxes look like for solo stakers. The underlying principles of staking are unchanged. However, most investors are not running validators themselves - they are getting exposure to staking through services where others run validators."}},"/third-party":{"title":"Using CEX or third-party provider to stake","data":{"":"Many centralized exchanges such as Binance offer staking services. However, these are different from liquid staking tokens as\nyou do not get a liquid staking token representing your stake\nyou are unable to transfer your position outside of the providers\nSome of these will provide you with reports of how much your stake earned and management fees charged."}}}